#Если Сервер Тогда

&Вместо("ПолучитьМакетИзменений")
Функция МОД_ПолучитьМакетИзменений(Форма)
	Если ТипЗнч(Форма) <> Тип("Структура") Тогда
		Поз = ПараметрыСеанса.МОД_ПоследниеФормыМакеты.Найти(Форма.ИмяФормы);
		Если Поз = Неопределено
			ИЛИ Поз > 0 Тогда
		
			ПоследниеФормыМакеты = Новый Массив(ПараметрыСеанса.МОД_ПоследниеФормыМакеты);
			Если Поз <> Неопределено Тогда
				ПоследниеФормыМакеты.Удалить(Поз);
			КонецЕсли;
			
			ПоследниеФормыМакеты.Вставить(0, Форма.ИмяФормы);
			ПараметрыСеанса.МОД_ПоследниеФормыМакеты = Новый ФиксированныйМассив(ПоследниеФормыМакеты);		
		КонецЕсли;
	КонецЕсли;

	АдресМакетаИзменений = ПараметрыСеанса.МОД_АдресМакетаИзменений.Получить(Форма.ИмяФормы);
	Если АдресМакетаИзменений <> Неопределено Тогда
		Результат = ПолучитьИзВременногоХранилища(АдресМакетаИзменений);
	Иначе
		Результат = ПродолжитьВызов(Форма);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&Вместо("ПолучитьМакет")
Функция МОД_ПолучитьМакет(ИмяМакета)
	Если ТипЗнч(ИмяМакета) <> Тип("Структура") Тогда
		Поз = ПараметрыСеанса.МОД_ПоследниеФормыМакеты.Найти(ИмяМакета);
		Если Поз = Неопределено
			ИЛИ Поз > 0 Тогда
		
			ПоследниеФормыМакеты = Новый Массив(ПараметрыСеанса.МОД_ПоследниеФормыМакеты);
			Если Поз <> Неопределено Тогда
				ПоследниеФормыМакеты.Удалить(Поз);
			КонецЕсли;
			
			ПоследниеФормыМакеты.Вставить(0, ИмяМакета);
			ПараметрыСеанса.МОД_ПоследниеФормыМакеты = Новый ФиксированныйМассив(ПоследниеФормыМакеты);
		КонецЕсли;
		
		НовоеИмяМакета = ИмяМакета;
	Иначе
		НовоеИмяМакета = ИмяМакета.ИмяМакета;
	КонецЕсли;
	
	АдресМакетаИзменений = ПараметрыСеанса.МОД_АдресМакетаИзменений.Получить(НовоеИмяМакета);
	Если АдресМакетаИзменений <> Неопределено Тогда
		Результат = ПолучитьИзВременногоХранилища(АдресМакетаИзменений);
	Иначе
		Результат = ПродолжитьВызов(НовоеИмяМакета);
	КонецЕсли;

	Возврат Результат;
КонецФункции

#КонецЕсли