///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019-2026, Щербаков Вадим, chtcherbakov.vadim@gmail.com
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
// Ссылка на репозиторий:
// https://github.com/shcherbakov-vadim/managed_forms_modification.git

Функция ИменаКоллекцийМетаданных() Экспорт
	ИменаКоллекций = Новый Соответствие;
	ИменаКоллекций.Вставить("Подсистема", "Подсистемы");
	ИменаКоллекций.Вставить("ОбщийМодуль", "ОбщиеМодули");
	ИменаКоллекций.Вставить("ПараметрСеанса", "ПараметрыСеанса");
	ИменаКоллекций.Вставить("Роль", "Роли");
	ИменаКоллекций.Вставить("ОбщийРеквизит", "ОбщиеРеквизиты");
	ИменаКоллекций.Вставить("ПланОбмена", "ПланыОбмена");
	ИменаКоллекций.Вставить("КритерийОтбора", "КритерииОтбора");
	ИменаКоллекций.Вставить("ПодпискаНаСобытие", "ПодпискиНаСобытия");
	ИменаКоллекций.Вставить("РегламентноеЗадание", "РегламентныеЗадания");
	ИменаКоллекций.Вставить("ФункциональнаяОпция", "ФункциональныеОпции");
	ИменаКоллекций.Вставить("ПараметрФункциональныхОпций", "ПараметрыФункциональныхОпций");
	ИменаКоллекций.Вставить("ОпределяемыйТип", "ОпределяемыеТипы");
	ИменаКоллекций.Вставить("ХранилищеНастроек", "ХранилищаНастроек");
	ИменаКоллекций.Вставить("ОбщаяФорма", "ОбщиеФормы");
	ИменаКоллекций.Вставить("ОбщаяКоманда", "ОбщиеКоманды");
	ИменаКоллекций.Вставить("ГруппаКоманд", "ГруппыКоманд");
	ИменаКоллекций.Вставить("ОбщийМакет", "ОбщиеМакеты");
	ИменаКоллекций.Вставить("ОбщаяКартинка", "ОбщиеКартинки");
	ИменаКоллекций.Вставить("ПакетXDTO", "ПакетыXDTO");
	ИменаКоллекций.Вставить("WebСервис", "WebСервисы");
	ИменаКоллекций.Вставить("HTTPСервис", "HTTPСервисы");
	ИменаКоллекций.Вставить("WSСсылка", "WSСсылки");
	ИменаКоллекций.Вставить("СервисИнтеграции", "СервисыИнтеграции");
	ИменаКоллекций.Вставить("ЭлементСтиля", "ЭлементыСтиля");
	ИменаКоллекций.Вставить("Стиль", "Стили");
	ИменаКоллекций.Вставить("Язык", "Языки");
	ИменаКоллекций.Вставить("Константа", "Константы");
	ИменаКоллекций.Вставить("Справочник", "Справочники");
	ИменаКоллекций.Вставить("Документ", "Документы");
	ИменаКоллекций.Вставить("Последовательность", "Последовательности");
	ИменаКоллекций.Вставить("ЖурналДокументов", "ЖурналыДокументов");
	ИменаКоллекций.Вставить("Перечисление", "Перечисления");
	ИменаКоллекций.Вставить("Отчет", "Отчеты");
	ИменаКоллекций.Вставить("Обработка", "Обработки");
	ИменаКоллекций.Вставить("ПланВидовХарактеристик", "ПланыВидовХарактеристик");
	ИменаКоллекций.Вставить("ПланСчетов", "ПланыСчетов");
	ИменаКоллекций.Вставить("ПланВидовРасчета", "ПланыВидовРасчета");
	ИменаКоллекций.Вставить("РегистрСведений", "РегистрыСведений");
	ИменаКоллекций.Вставить("РегистрНакопления", "РегистрыНакопления");
	ИменаКоллекций.Вставить("РегистрБухгалтерии", "РегистрыБухгалтерии");
	ИменаКоллекций.Вставить("РегистрРасчета", "РегистрыРасчета");
	ИменаКоллекций.Вставить("БизнесПроцесс", "БизнесПроцессы");
	ИменаКоллекций.Вставить("Задача", "Задачи");
	ИменаКоллекций.Вставить("ВнешниеИсточникиДанных", "ВнешнийИсточникДанных");
	
	Возврат Новый ФиксированноеСоответствие(ИменаКоллекций);
КонецФункции

Функция КомандаИзменяетДанные(ИмяЭлемента) Экспорт
	ОстатокИмени = ИмяЭлемента;
	Если СтрНачинаетсяС(ОстатокИмени, "Форма") Тогда
		ОстатокИмени = Сред(ОстатокИмени, СтрДлина("Форма") + 1);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	КоллекцияМетаданных = Неопределено;
	ИменаКоллекций = ИменаКоллекцийМетаданных();
	Для Каждого ЭлементСоответствия Из ИменаКоллекций Цикл
		Если Сред(ОстатокИмени, 1, СтрДлина(ЭлементСоответствия.Ключ)) = ЭлементСоответствия.Ключ Тогда
			КоллекцияМетаданных = Метаданные[ЭлементСоответствия.Значение];
			ОстатокИмени = Сред(ОстатокИмени, СтрДлина(ЭлементСоответствия.Ключ) + 1);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КоллекцияМетаданных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеКоманды = Неопределено;
	Если КоллекцияМетаданных = Метаданные.ОбщиеКоманды Тогда
		МетаданныеКоманды = КоллекцияМетаданных.Найти(ОстатокИмени);
	Иначе
		Для Каждого МетаданныеОбъекта Из КоллекцияМетаданных Цикл
			Если Сред(ОстатокИмени, 1, СтрДлина(МетаданныеОбъекта.Имя)) = МетаданныеОбъекта.Имя Тогда
				Для Каждого МетаданныеКомандыОбъекта Из МетаданныеОбъекта.Команды Цикл
					Если ОстатокИмени = МетаданныеОбъекта.Имя + МетаданныеКомандыОбъекта.Имя Тогда
						МетаданныеКоманды = МетаданныеКомандыОбъекта;
						Прервать;	
					КонецЕсли;
				КонецЦикла;
				
				Если МетаданныеКоманды <> Неопределено Тогда
					Прервать;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МетаданныеКоманды <> Неопределено 
		И МетаданныеКоманды.ИзменяетДанные;
КонецФункции