
&После("УстановкаПараметровСеанса")
Процедура МОД_УстановкаПараметровСеанса(ТребуемыеПараметры)
	Если ТребуемыеПараметры <> Неопределено
		И ТребуемыеПараметры.Найти("МОД_АдресМакетаИзменений") <> Неопределено Тогда
		
		ПараметрыСеанса.МОД_АдресМакетаИзменений = Новый ФиксированноеСоответствие(Новый Соответствие);
	КонецЕсли;
	
	Если ТребуемыеПараметры <> Неопределено
		И ТребуемыеПараметры.Найти("МОД_ИмяПоследнейФормы") <> Неопределено Тогда
		
		ПараметрыСеанса.МОД_ИмяПоследнейФормы = "";
	КонецЕсли;
КонецПроцедуры
