&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МодификацияУправляемыхФорм.ПрименитьМакетИзменений(ЭтаФорма);
	МодификацияУправляемыхФорм.ПрименитьМакетИзменений(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьОграничениеИзмененияРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьОграничениеИзмененияРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
КонецПроцедуры

&НаКлиенте
Процедура МОД_РассчитатьПроценты()
	Сообщить("МОД_РассчитатьПроценты");	
КонецПроцедуры

&НаКлиенте
Процедура МОД_ДополнительныеРасходыНоменклатураПриИзменении(Элемент)
	Сообщить("МОД_ДополнительныеРасходыНоменклатураПриИзменении");
КонецПроцедуры

&НаКлиенте
Процедура МОД_ДополнительныеРасходыЗначениеПриИзменении(Элемент)
	Сообщить("МОД_ДополнительныеРасходыЗначениеПриИзменении");
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
КонецПроцедуры

Процедура ОбновитьОграничениеИзмененияРеквизитов()
	Если Объект.МОД_Утвержден = ЭтаФорма.МОД_БылУтвержден Тогда
		Возврат;
	КонецЕсли;
	
	МодификацияУправляемыхФорм.ОтменитьОграничениеИзмененияРеквизитов(ЭтаФорма);
	Если Объект.МОД_Утвержден Тогда
		МодификацияУправляемыхФорм.ОграничитьИзменениеРеквизитов(ЭтаФорма, "МОД_Утвержден");
	КонецЕсли;
	
	ЭтаФорма.МОД_БылУтвержден = Объект.МОД_Утвержден;
КонецПроцедуры

#Если Сервер Тогда
МодификацияУправляемыхФорм.ПрименитьМакетИзменений(ЭтаФорма);
#КонецЕсли
