&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МодификацияУправляемыхФорм.ПрименитьМакетИзменений(ЭтаФорма);
	МодификацияУправляемыхФорм.ПрименитьМакетИзменений(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МОД_РассчитатьПроценты()
	Сообщить("МОД_РассчитатьПроценты");	
КонецПроцедуры

&НаКлиенте
Процедура МОД_ДополнительныеРасходыНоменклатураПриИзменении(Элемент)
	Сообщить("МОД_ДополнительныеРасходыНоменклатураПриИзменении");
КонецПроцедуры

&НаКлиенте
Процедура МОД_ДополнительныеРасходыЗначениеПриИзменении(Элемент)
	Сообщить("МОД_ДополнительныеРасходыЗначениеПриИзменении");
КонецПроцедуры

#Если Сервер Тогда
МодификацияУправляемыхФорм.ПрименитьМакетИзменений(ЭтаФорма);
#КонецЕсли
